<a href="https://colab.research.google.com/github/nv-hiep/pyspark/blob/main/pyspark_course_GL_with_MusicData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import os

# innstall java
!apt-get install openjdk-8-jdk-headless -qq > /dev/null

# install spark (change the version number if needed)
if not os.path.exists('/content/spark-3.1.1-bin-hadoop3.2.tgz'):
  !wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
  
  # unzip the spark file to the current folder
  !tar xf spark-3.1.1-bin-hadoop3.2.tgz

# set your spark folder to your system path environment. 
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"


# install findspark using pip
!pip install -q findspark

In [ ]:
# For python users, you should also install pyspark using the following command.
# !pip install pyspark

Run a local spark session to test your installation:

In [ ]:
import findspark
findspark.init()

from pyspark import SparkContext
from pyspark.sql import SparkSession, Window, Row

from pyspark.sql.functions import *
from pyspark.sql.types import *
import matplotlib.pyplot as plt

#https://spark.apache.org/docs/latest/sql-getting-started.html
# spark = SparkSession.builder.master("local[*]").getOrCreate()
spark = SparkSession.builder.appName('PySpark').getOrCreate()
# spark = SparkSession.builder.appName('PySpark').enableHiveSupport().getOrCreate()

spark.conf.set('spark.sql.repl.eagerEval.enabled', True) # Property used to format output tables better


# spark = SparkSession.builder.appName('PySpark').master("local[1]").config("spark.sql.catalogImplementation","hive").enableHiveSupport().getOrCreate()
# spark.conf.set("spark.sql.catalogImplementation","hive")
# spark.conf.set('spark.sql.sources.default', 'delta')
# spark.conf.set('spark.sql.legacy.createHiveTableByDefault', False)
# spark.conf.set('spspark.sql.hive.convertCTAS', True)

spark

In [ ]:
import numpy as np
import pandas as pd
from scipy.sparse import csr_matrix

# display results to 3 decimal points, not in scientific notation
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [ ]:
# from pyspark.sql.functions import udf
# from pyspark.sql.types import IntegerType
import urllib.request

In [ ]:
# ! rm -rf spark-3.1.1-bin-hadoop3.2.tgz

In [ ]:
!ls

data	     lastfm.zip   spark-3.1.1-bin-hadoop3.2
kaggle.json  sample_data  spark-3.1.1-bin-hadoop3.2.tgz

In [ ]:
from pyspark.ml.classification import LogisticRegression

# Connect to Kaggle

Ref: https://galhever.medium.com/how-to-import-data-from-kaggle-to-google-colab-8160caa11e2

Install the Kaggle package that will be used for importing the data.

In [ ]:
!pip install kaggle

Requirement already satisfied: kaggle in /usr/local/lib/python3.7/dist-packages (1.5.12)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.15.0)
Requirement already satisfied: urllib3 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.24.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.7/dist-packages (from kaggle) (4.41.1)
Requirement already satisfied: requests in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.23.0)
Requirement already satisfied: certifi in /usr/local/lib/python3.7/dist-packages (from kaggle) (2021.5.30)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.8.1)
Requirement already satisfied: python-slugify in /usr/local/lib/python3.7/dist-packages (from kaggle) (5.0.2)
Requirement already satisfied: text-unidecode>=1.3 in /usr/local/lib/python3.7/dist-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (3.0.4)

Next, we need to upload the credentials of our Kaggle account. To do so, you need to enter your profile and “Create New API Token”. If you already have one you can click on “Expire API Token” and create a new one.

Then, save the json file with your credentials on your computer and upload this file to Colab using the code below:

In [ ]:
from google.colab import files

if not os.path.exists('/content/kaggle.json'):
  files.upload()

Saving kaggle.json to kaggle (1).json

{'kaggle.json': b'{"username":"kiemhiep","key":"346d05746c99fb614062800d8014518f"}'}

The Kaggle API client expects the json file to be in ~/.kaggle folder so let’s create a new folder and move it inside.

In [ ]:
!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/
!chmod 600 ~/.kaggle/kaggle.json

Next, we will click on the three vertical points on the right side of the screen and “Copy the API Command” of the dataset that we want to import from Kaggle.

In [ ]:
# !kaggle datasets download -d jessicali9530/celeba-dataset
# !kaggle datasets download -d hesh97/titanicdataset-traincsv
! kaggle datasets download -d neferfufi/lastfm

lastfm.zip: Skipping, found more recently modified local copy (use --force to force download)

In [ ]:
!pwd

/content

Let’s see the imported files:

In [ ]:
!ls

 data		    lastfm.zip		        spark-3.1.1-bin-hadoop3.2.tgz
'kaggle (1).json'   sample_data
 kaggle.json	    spark-3.1.1-bin-hadoop3.2

Now, the last step is to open the extracted files and get the data:

In [ ]:
import zipfile
zip_ref = zipfile.ZipFile('lastfm.zip', 'r')
zip_ref.extractall('data')
zip_ref.close()

In [ ]:
!ls

 data		    lastfm.zip		        spark-3.1.1-bin-hadoop3.2.tgz
'kaggle (1).json'   sample_data
 kaggle.json	    spark-3.1.1-bin-hadoop3.2

In [ ]:
# ! rm -rf titanicdataset-traincsv.zip

In [ ]:
# !ls

In [ ]:
% cd data

/content/data

In [ ]:
!ls

userid-profile.csv				  usersha1-profile.csv
userid-timestamp-artid-artname-traid-traname.tsv  usersha1-profile.tsv
usersha1-artmbid-artname-plays.tsv

That’s it! Now your data is ready and you can start working on it.

# Load data

In [ ]:
DATA_PATH = '/content/'
DATA_DIR  = os.path.join(DATA_PATH, 'data')

In [ ]:
if not os.path.exists(DATA_DIR):
  os.mkdir(DATA_DIR)

In [ ]:
# url = 'https://storage.googleapis.com/kaggle-data-sets/50119/92017/compressed/userid-timestamp-artid-artname-traid-traname.tsv.zip?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20210724%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20210724T145658Z&X-Goog-Expires=259199&X-Goog-SignedHeaders=host&X-Goog-Signature=95a835e0400112e6132be28d12009dec126eab889e0c98f15c46ed9ff843d435150e8006991a7cf518a97bb49bfd110d6c732fb6bbb42156221abd376a466cea004e79dfdb16aeef9d0049442e221a6ff07d9580aa2aa0e1281e0cea1f81c2584d9b654da5d2eb59fa04eb78dd94b0d7f1c93c851efdeec15765a54269b45a99cd09546bcb18b6f9e7d0924e273637ff7d729a715b0b1f774862ced30b9f16ddefdb326af90f4b997f1bc600a3c4442080885a546e26252a8bea6d1f057be19476a60bf1651499ca524fcd3a5bc8180b7fe828fa91680d7907a45a2c9cef38c00d4a602a6524986a1978546bd2ea30af22eaa562aa818e5868ae552599d8888c'
# datfile = os.path.join( DATA_DIR, os.path.split(url)[-1])

# if not os.path.exists(datfile):
#   filename, headers = urllib.request.urlretrieve(url, datfile)

In [ ]:
! ls

userid-profile.csv				  usersha1-profile.csv
userid-timestamp-artid-artname-traid-traname.tsv  usersha1-profile.tsv
usersha1-artmbid-artname-plays.tsv

In [ ]:
raw_data = pd.read_csv( os.path.join(DATA_DIR, 'userid-timestamp-artid-artname-traid-traname.tsv'),
                       delimiter='\t', header=None, error_bad_lines=False)

b'Skipping line 2120260: expected 6 fields, saw 8\n'
b'Skipping line 2446318: expected 6 fields, saw 8\n'
b'Skipping line 11141081: expected 6 fields, saw 8\n'
b'Skipping line 11152099: expected 6 fields, saw 12\nSkipping line 11152402: expected 6 fields, saw 8\n'
b'Skipping line 11882087: expected 6 fields, saw 8\n'
b'Skipping line 12902539: expected 6 fields, saw 8\nSkipping line 12935044: expected 6 fields, saw 8\n'
b'Skipping line 17589539: expected 6 fields, saw 8\n'

In [ ]:
raw_data.head()

             0  ...                                           5
0  user_000001  ...  Fuck Me Im Famous (Pacha Ibiza)-09-28-2007
1  user_000001  ...           Composition 0919 (Live_2009_4_15)
2  user_000001  ...                        Mc2 (Live_2009_4_15)
3  user_000001  ...                     Hibari (Live_2009_4_15)
4  user_000001  ...                        Mc1 (Live_2009_4_15)

[5 rows x 6 columns]

In [ ]:
raw_data.columns = ['user_id', 'timestamp', 'artist_id', 'artist_name', 'song_id', 'song_name']

In [ ]:
raw_data.head()

       user_id  ...                                   song_name
0  user_000001  ...  Fuck Me Im Famous (Pacha Ibiza)-09-28-2007
1  user_000001  ...           Composition 0919 (Live_2009_4_15)
2  user_000001  ...                        Mc2 (Live_2009_4_15)
3  user_000001  ...                     Hibari (Live_2009_4_15)
4  user_000001  ...                        Mc1 (Live_2009_4_15)

[5 rows x 6 columns]

In [ ]:
raw_data.describe()

            user_id  ... song_name
count      19098853  ...  19098841
unique          992  ...   1083471
top     user_000949  ...     Intro
freq         183103  ...     17561

[4 rows x 6 columns]

In [ ]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19098853 entries, 0 to 19098852
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      object
 1   timestamp    object
 2   artist_id    object
 3   artist_name  object
 4   song_id      object
 5   song_name    object
dtypes: object(6)
memory usage: 874.3+ MB

# Read userid_profile data

In [ ]:
user_profile = pd.read_csv( os.path.join(DATA_DIR, 'userid-profile.csv'), sep=',' )
user_profile.head()

           #id gender    age        country    registered
0  user_000001      m    nan          Japan  Aug 13, 2006
1  user_000002      f    nan           Peru  Feb 24, 2006
2  user_000003      m 22.000  United States  Oct 30, 2005
3  user_000004      f    nan            NaN  Apr 26, 2006
4  user_000005      m    nan       Bulgaria  Jun 29, 2006

In [ ]:
user_profile.columns

Index(['#id', 'gender', 'age', 'country', 'registered'], dtype='object')

In [ ]:
user_profile.describe()

          age
count 286.000
mean   25.367
std     8.315
min     3.000
25%    21.000
50%    23.000
75%    28.000
max   103.000

In [ ]:
user_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 992 entries, 0 to 991
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #id         992 non-null    object
 1   gender      884 non-null    object
 2   age         286 non-null    float64
 3   country     907 non-null    object
 4   registered  984 non-null    object
dtypes: float64(1), object(4)
memory usage: 38.9+ KB

In [ ]:
# Check null values
user_profile.isnull().sum(axis = 0)

#id             0
gender        108
age           706
country        85
registered      8
dtype: int64

In [ ]:
user_profile.gender.value_counts()

m    502
f    382
Name: gender, dtype: int64

In [ ]:
user_profile.country.value_counts()

United States                     228
United Kingdom                    126
Poland                             50
Germany                            36
Norway                             35
                                 ...
British Indian Ocean Territory      1
Malta                               1
Macedonia                           1
Israel                              1
Zimbabwe                            1
Name: country, Length: 66, dtype: int64

In [ ]:
user_profile.registered.value_counts()

Dec 6, 2005     6
Jan 22, 2006    5
Dec 4, 2005     5
Dec 19, 2006    5
Mar 5, 2006     5
               ..
Feb 17, 2007    1
Jul 11, 2006    1
Dec 5, 2005     1
Jan 23, 2006    1
Jan 13, 2006    1
Name: registered, Length: 625, dtype: int64

# Load user data

In [ ]:
data_file = os.path.join( DATA_DIR, 'usersha1-artmbid-artname-plays.tsv' )
user_data = pd.read_csv( data_file, sep='\t', header=None )
user_data

                                                 0  ...     3
0         00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1         00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099
2         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   897
3         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   717
4         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   706
...                                            ...  ...   ...
17535650                              sep 20, 2008  ...    12
17535651                              sep 20, 2008  ...    11
17535652                              sep 20, 2008  ...    11
17535653                              sep 20, 2008  ...    10
17535654                              sep 20, 2008  ...    10

[17535655 rows x 4 columns]

In [ ]:
user_data.columns = ['user_id', 'musicbrainz-artist-id', 'artist-name', 'plays']

In [ ]:
user_data.head()

                                    user_id  ... plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099
2  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   897
3  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   717
4  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   706

[5 rows x 4 columns]

In [ ]:
user_data.isnull().sum()

user_id                       0
musicbrainz-artist-id    226137
artist-name                 204
plays                         0
dtype: int64

In [ ]:
user_data[ user_data['artist-name'].isnull() ]

                                           user_id  ... plays
244853    039e5d61d65bbf5e6d95b07b1b3b67f7fd287a62  ...    18
431015    065a001be5a8a55971042077933e263d0d5cde46  ...   186
455721    06b17c50402d06a497cb13a0375992fd1e90b392  ...     3
504026    0757ac29973aab69bb31cd164c6df975bf4df9a1  ...    38
607282    08e102b376abe856a3d4be5ea14ad6b37395fe82  ...   208
...                                            ...  ...   ...
17227026  fb7aec57827b2bd6152b84ef2034bc5aa023fe89  ...    13
17306503  fcaa2f605a2c6d2cd21942a20f80c7e1c14e1818  ...     5
17404362  fe1503af166a337f6a572da66b99b4cd0da362b2  ...    62
17429832  fe72cbf58e485fab12211834244ff8dbf314b590  ...    63
17480740  ff2cb5365215e7bf4a64e7bee1f6c9b83a33609b  ...    12

[204 rows x 4 columns]

In [ ]:
# Drop all rows where artist-name is null
if user_data['artist-name'].isnull().sum() > 0:
  user_data.dropna( axis=0, subset=['artist-name'], inplace=True )

In [ ]:
user_data[ user_data['artist-name'].isnull() ]

Empty DataFrame
Columns: [user_id, musicbrainz-artist-id, artist-name, plays]
Index: []

In [ ]:
user_data['artist-name'].isnull().sum()

0

In [ ]:
user_data

                                           user_id  ... plays
0         00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1         00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099
2         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   897
3         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   717
4         00000c289a1829a808ac09c00daf10bc3c4e223b  ...   706
...                                            ...  ...   ...
17535650                              sep 20, 2008  ...    12
17535651                              sep 20, 2008  ...    11
17535652                              sep 20, 2008  ...    11
17535653                              sep 20, 2008  ...    10
17535654                              sep 20, 2008  ...    10

[17535451 rows x 4 columns]

In [ ]:
user_data['artist-name'].unique()

array(['betty blowtorch', 'die Ärzte', 'melissa etheridge', ...,
       'sacred buddha', 'cat lunette', 'suzanina'], dtype=object)

In [ ]:
user_data['artist-name'].nunique()

292363

In [ ]:
user_data['artist-name'].value_counts()

radiohead                        77254
the beatles                      76245
coldplay                         66658
red hot chili peppers            48924
muse                             46954
                                 ...
la naranja                           1
a.j. & company/aly                   1
broken speakers                      1
a coeur joie suisse chante...        1
roy oribison                         1
Name: artist-name, Length: 292363, dtype: int64

In [ ]:
artist_plays = user_data.groupby( ['artist-name'] ).sum().reset_index().rename( columns={'plays' : 'total_plays'} )
artist_plays.head()

                                 artist-name  total_plays
0                                       04)]            6
1                                         2          1606
2                                  58725ab=>           23
3   80lİ yillarin tÜrkÇe sÖzlÜ aŞk Şarkilari           70
4                              amy winehouse           23

In [ ]:
user_data_with_artist_plays = user_data.merge( artist_plays, left_on='artist-name', right_on='artist-name', how='left' )

In [ ]:
user_data_with_artist_plays.head()

                                    user_id  ... total_plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...       25651
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...     3704875
2  00000c289a1829a808ac09c00daf10bc3c4e223b  ...      180391
3  00000c289a1829a808ac09c00daf10bc3c4e223b  ...      410725
4  00000c289a1829a808ac09c00daf10bc3c4e223b  ...       90498

[5 rows x 4 columns]

In [ ]:
artist_plays.total_plays.describe()

count     292363.000
mean       12907.022
std       185981.631
min            1.000
25%           53.000
50%          208.000
75%         1048.000
max     30466827.000
Name: total_plays, dtype: float64

In [ ]:
artist_plays[ artist_plays.total_plays == artist_plays.total_plays.max() ]

        artist-name  total_plays
252494  the beatles     30466827

In [ ]:
artist_plays.total_plays.quantile( np.arange(0.9, 1., 0.02) )

0.900    6137.800
0.920    9102.040
0.940   14898.000
0.960   28420.120
0.980   79403.560
Name: total_plays, dtype: float64

In [ ]:
artist_plays.total_plays.value_counts()

1        2816
2        2724
3        2365
4        2211
5        2123
         ...
52887       1
40605       1
36511       1
67246       1
21621       1
Name: total_plays, Length: 28112, dtype: int64

In [ ]:
# Only top artist
thresh = 100000
top_artist = user_data_with_artist_plays.query( 'total_plays >= @thresh' )
top_artist.drop('musicbrainz-artist-id', axis=1)

                                           user_id  ... total_plays
1         00000c289a1829a808ac09c00daf10bc3c4e223b  ...     3704875
2         00000c289a1829a808ac09c00daf10bc3c4e223b  ...      180391
3         00000c289a1829a808ac09c00daf10bc3c4e223b  ...      410725
5         00000c289a1829a808ac09c00daf10bc3c4e223b  ...    13547741
7         00000c289a1829a808ac09c00daf10bc3c4e223b  ...     1004743
...                                            ...  ...         ...
17535445                              sep 20, 2008  ...      182668
17535446                              sep 20, 2008  ...      137276
17535448                              sep 20, 2008  ...      108336
17535449                              sep 20, 2008  ...     8215598
17535450                              sep 20, 2008  ...     6408722

[12613275 rows x 3 columns]

In [ ]:
user_data_with_artist_plays.head()

                                    user_id  ... total_plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...       25651
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...     3704875
2  00000c289a1829a808ac09c00daf10bc3c4e223b  ...      180391
3  00000c289a1829a808ac09c00daf10bc3c4e223b  ...      410725
4  00000c289a1829a808ac09c00daf10bc3c4e223b  ...       90498

[5 rows x 4 columns]

# Read user_profiles data

In [ ]:
data_file = os.path.join( DATA_DIR, 'usersha1-profile.tsv' )
user_profiles = pd.read_csv(data_file, sep='\t', header=None)
user_profiles

                                               0  ...             4
0       00000c289a1829a808ac09c00daf10bc3c4e223b  ...   Feb 1, 2007
1       00001411dc427966b17297bf4d69e7e193135d89  ...   Dec 4, 2007
2       00004d2ac9316e22dc007ab2243d6fcb239e707d  ...   Sep 1, 2006
3       000063d3fe1cf2ba248b9e3c3f0334845a27a6bf  ...  Apr 28, 2008
4       00007a47085b9aab8af55f52ec8846ac479ac4fe  ...  Jan 27, 2006
...                                          ...  ...           ...
359342  fffe7823f67b433b45f22056467db921c1d3d7d0  ...  Jun 24, 2006
359343  fffe8637bd8234309e871409c7ebef99a720afc1  ...   Sep 9, 2007
359344  fffe8c7f952d9b960a56ed4dcb40a415d924b224  ...   Aug 8, 2007
359345  ffff9af9ae04d263dae91cb838b1f3a6725f5ffb  ...   Dec 3, 2005
359346  ffff9ef87a7d9494ada2f9ade4b9ff637c0759ac  ...  Nov 25, 2008

[359347 rows x 5 columns]

In [ ]:
user_profiles.columns = ['user', 'gender', 'age', 'country', 'registered']
user_profiles.head()

                                       user gender  ...        country    registered
0  00000c289a1829a808ac09c00daf10bc3c4e223b      f  ...        Germany   Feb 1, 2007
1  00001411dc427966b17297bf4d69e7e193135d89      f  ...         Canada   Dec 4, 2007
2  00004d2ac9316e22dc007ab2243d6fcb239e707d    NaN  ...        Germany   Sep 1, 2006
3  000063d3fe1cf2ba248b9e3c3f0334845a27a6bf      m  ...         Mexico  Apr 28, 2008
4  00007a47085b9aab8af55f52ec8846ac479ac4fe      m  ...  United States  Jan 27, 2006

[5 rows x 5 columns]

In [ ]:
combined = top_artist.merge( user_profiles, left_on='user_id', right_on='user', how='left' ).drop( ['musicbrainz-artist-id', 'user_id'], axis=1 )
combined

                      artist-name  total_plays  ...  country   registered
0                       die Ärzte      3704875  ...  Germany  Feb 1, 2007
1               melissa etheridge       180391  ...  Germany  Feb 1, 2007
2                       elvenking       410725  ...  Germany  Feb 1, 2007
3           red hot chili peppers     13547741  ...  Germany  Feb 1, 2007
4         the black dahlia murder      1004743  ...  Germany  Feb 1, 2007
...                           ...          ...  ...      ...          ...
12613270               the stills       182668  ...      NaN          NaN
12613271               turbostaat       137276  ...      NaN          NaN
12613272          little man tate       108336  ...      NaN          NaN
12613273                sigur rós      8215598  ...      NaN          NaN
12613274               the smiths      6408722  ...      NaN          NaN

[12613275 rows x 7 columns]

In [ ]:
combined_user_data = combined.query( "country == 'United States'" )
combined_user_data

                artist-name  total_plays  ...        country    registered
134        devendra banhart      2366807  ...  United States  Jan 27, 2006
135        boards of canada      6115545  ...  United States  Jan 27, 2006
136               cocorosie      2194862  ...  United States  Jan 27, 2006
137              aphex twin      4248296  ...  United States  Jan 27, 2006
138       animal collective      3495537  ...  United States  Jan 27, 2006
...                     ...          ...  ...            ...           ...
12613173           chevelle       912075  ...  United States   Aug 8, 2007
12613174              vader      1195526  ...  United States   Aug 8, 2007
12613175      powerman 5000       337738  ...  United States   Aug 8, 2007
12613176           behemoth      2149780  ...  United States   Aug 8, 2007
12613177          green day      7611345  ...  United States   Aug 8, 2007

[2525274 rows x 7 columns]